/**
 * 9.蒙眼过马路
 * 假设我们确定在每小时开始时，交通信号灯显示为绿色 3
 * 分钟，黄色一分钟，红色一分钟。然后按此顺序重复。
 * 我们的程序必须能够确定现在点亮的灯是什么颜色（“现在”是一个实际数字，它表示从小时开始后经过的分钟数）。
 * 行人交通信号灯的编程如下：
 * 在每小时开始时，绿色信号灯点亮三分钟，
 * 接下来黄色信号灯点亮一分钟，
 * 然后红色信号灯点亮一分钟。
 * 接下来绿色信号灯再次点亮三分钟，以此类推。
 * 使用键盘输入一个实际的数字 t，用于表示从小时开始后经过的分钟数。
 * 确定在指定时间什么颜色的交通信号灯处于点亮状态。
 * 按如下所示显示结果：
 * 如果绿灯点亮，则为“绿色”，
 * 如果黄灯点亮，则为“黄色”，
 * 如果红灯点亮，则为“红色”。
 * 
 * 例如，对于 2.5：
 * 绿色
 * 例如，对于 3：
 * 黄色
 * 例如，对于 4：
 * 红色
 * 例如，对于 5：
 * 绿色
 */
class Test {
    public static void main(String[] args) {

    }
}

public class CrossingTheRoad {

}
